keep moving away from mermaid diagrams as while they look good, they often have build errors on the CI pipeline
